Catalogs/ТерриторииСПовышающимКоэффициентомПоКоронавирусу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ТерриторииСПовышающимКоэффициентомПоКоронавирусу</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Область</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТерриторииСПовышающимКоэффициентомПоКоронавирусу/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
// Используется для сопоставления элементов механизмом «Выгрузка/загрузка областей данных».
//
// Возвращаемое значение:
//  Массив(Строка) - массив имен реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Код");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальногоЗаполненияИОбновленияИБ

Процедура ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, Код, Область, Район, Коэффициент)
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код 			= Код;
	НоваяСтрокаКлассификатора.Область 		= Область;
	НоваяСтрокаКлассификатора.Район 		= Район;
	НоваяСтрокаКлассификатора.Коэффициент 	= Коэффициент;
	
КонецПроцедуры

Функция ТаблицаКлассификатора()
	
	ТаблицаКлассификатора = Новый ТаблицаЗначений;
	ТаблицаКлассификатора.Колонки.Добавить("Код");
	ТаблицаКлассификатора.Колонки.Добавить("Область");
	ТаблицаКлассификатора.Колонки.Добавить("Район");
	ТаблицаКлассификатора.Колонки.Добавить("Коэффициент");
	
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0100", "Острова Северного Ледовитого океана и его морей (за исключением островов Белого моря)", "",1);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0200", "Мурманская область", "", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0301", "Архангельская область", "Муниципальный район Мезенский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0302", "Архангельская область", "Муниципальный район Лешуконский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0303", "Архангельская область", "Муниципальный район Пинежский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0304", "Архангельская область", "Сельское поселение Соловецкое Приморского муниципального района", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0305", "Архангельская область", "Городской округ Северодвинск", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0399", "Архангельская область", "Остальная территория области", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0400", "Ненецкий автономный округ", "", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0501", "Республика Коми", "Муниципальный район Усть-Цилемский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0502", "Республика Коми", "Муниципальный район Ижемский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0503", "Республика Коми", "Муниципальный район Печора", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0504", "Республика Коми", "Городской округ Воркута", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0505", "Республика Коми", "Городской округ Инта", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0506", "Республика Коми", "Городской округ Усинск", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0599", "Республика Коми", "Остальная территория республики", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0601", "Республика Карелия", "Муниципальный район Беломорский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0602", "Республика Карелия", "Муниципальный район Калевальский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0603", "Республика Карелия", "Муниципальный район Кемский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0604", "Республика Карелия", "Муниципальный район Лоухский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0605", "Республика Карелия", "Городской округ Костомукшский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0699", "Республика Карелия", "Остальная территория республики", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0701", "Пермский край", "Муниципальный район Гайнский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0702", "Пермский край", "Муниципальный район Косинский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0703", "Пермский край", "Муниципальный район Кочевский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0799", "Пермский край", "Остальная территория края", 0);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0800", "Ямало-Ненецкий автономный округ", " ", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0901", "Ханты-Мансийский автономный округ-Югра", "Муниципальный район Белоярский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0902", "Ханты-Мансийский автономный округ-Югра", "Муниципальный район Березовский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "0999", "Ханты-Мансийский автономный округ-Югра", "Остальная территория округа", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1001", "Тюменская область", "Муниципальный район Уватский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1099", "Тюменская область", "Остальная территория области", 0);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1101", "Республика Алтай", "Муниципальный район Кош-Агачский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1102", "Республика Алтай", "Муниципальный район Улаганский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1199", "Республика Алтай", "Остальная территория республики", 0);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1201", "Республика Тыва", "Муниципальный район Монгун-Тайгинский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1202", "Республика Тыва", "Муниципальный район Тоджинский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1203", "Республика Тыва", "Сельское поселение сумон Шынаанский Тере-Хольского района", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1299", "Республика Тыва", "Остальные районы республики", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1300", "Республика Хакасия", " ", 0.3);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1401", "Красноярский край", "Муниципальный район Таймырский Долгано-Ненецкий", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1402", "Красноярский край", "Муниципальный район Эвенкийский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1403", "Красноярский край", "Муниципальный район Северо-Енисейский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1404", "Красноярский край", "Муниципальный район Туруханский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1405", "Красноярский край", "Городской округ Норильск", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1406", "Красноярский край", "Муниципальный район Богучанский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1407", "Красноярский край", "Муниципальный район Енисейский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1408", "Красноярский край", "Муниципальный район Кежемский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1409", "Красноярский край", "Муниципальный район Мотыгинский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1410", "Красноярский край", "Городской округ Енисейск", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1411", "Красноярский край", "Городской округ Лесосибирск", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1499", "Красноярский край", "Остальная территория края", 0.3);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1501", "Иркутская область", "Муниципальный район Катангский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1502", "Иркутская область", "Муниципальный район Бодайбинский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1503", "Иркутская область", "Муниципальный район Братский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1504", "Иркутская область", "Муниципальный район Казачинско-Ленский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1505", "Иркутская область", "Муниципальный район Киренский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1506", "Иркутская область", "Муниципальный район Мамско-Чуйский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1507", "Иркутская область", "Муниципальный район Нижнеилимский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1508", "Иркутская область", "Муниципальный район Усть-Илимский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1509", "Иркутская область", "Муниципальный район Усть-Кутский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1510", "Иркутская область", "Городской округ Усть-Илимск", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1511", "Иркутская область", "Городской округ Братск", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1599", "Иркутская область", "Остальная территория области", 0.3);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1601", "Томская область", "Муниципальный район Александровский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1602", "Томская область", "Муниципальный район Бакчарский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1603", "Томская область", "Муниципальный район Верхнекетский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1604", "Томская область", "Муниципальный район Каргасокский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1605", "Томская область", "Муниципальный район Колпашевский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1606", "Томская область", "Муниципальный район Кривошеинский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1607", "Томская область", "Муниципальный район Молчановский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1608", "Томская область", "Муниципальный район Парабельский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1609", "Томская область", "Муниципальный район Чаинский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1610", "Томская область", "Муниципальный район Тегульдетский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1613", "Томская область", "Городской округ город Стрежевой", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1614", "Томская область", "Городской округ город Кедровый", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1699", "Томская область", "Остальная территория области", 0);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1701", "Республика Бурятия", "Муниципальный район Баунтовский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1702", "Республика Бурятия", "Муниципальный район Баргузинский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1703", "Республика Бурятия", "Муниципальный район Курумканский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1704", "Республика Бурятия", "Муниципальный район Окинский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1705", "Республика Бурятия", "Муниципальный район Муйский, Северо-Байкальский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1706", "Республика Бурятия", "Муниципальный район Северо-Байкальский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1707", "Республика Бурятия", "Городской округ «Северобайкальск»", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1799", "Республика Бурятия", "Остальная территория республики", 0.3);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1801", "Забайкальский край", "Муниципальный округ Каларский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1802", "Забайкальский край", "Муниципальный район Тунгиро-Олекминский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1803", "Забайкальский край", "Муниципальный район Тунгокоченский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1899", "Забайкальский край", "Остальная территория края", 0.3);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "1900", "Республика Саха (Якутия)", "", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2001", "Магаданская область", "Северо – Эвенский район", 1);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2099", "Магаданская область", "Остальная территория област", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2100", "Чукотский автономный округ", "", 1);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2201", "Камчатский край", "Корякский округ", 1);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2202", "Камчатский край", "Алеутский район (Командорские острова)", 1);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2299", "Камчатский край", "Остальная территория края", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2301", "Хабаровский край", "Муниципальный район Аяно-Майский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2302", "Хабаровский край", "Муниципальный район Охотский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2303", "Хабаровский край", "Муниципальный район Ванинский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2304", "Хабаровский край", "Муниципальный район Верхнебуреинский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2305", "Хабаровский край", "Муниципальный район Комсомольский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2306", "Хабаровский край", "Муниципальный район Николаевский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2307", "Хабаровский край", "Муниципальный район имени Полины Осипенко", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2308", "Хабаровский край", "Муниципальный район Советско-Гаванский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2309", "Хабаровский край", "Муниципальный район Солнечный", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2310", "Хабаровский край", "Муниципальный район Тугиро-Чумиканский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2311", "Хабаровский край", "Муниципальный район Ульчский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2312", "Хабаровский край", "Городское поселение город Амурск", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2313", "Хабаровский край", "Городское поселение Эльбанское", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2314", "Хабаровский край", "Сельское поселение Вознесенское", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2315", "Хабаровский край", "Сельское поселение Падалинское", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2316", "Хабаровский край", "Сельское поселение Село Ачан", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2317", "Хабаровский край", "Сельское поселение Село Джуен", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2318", "Хабаровский край", "Сельское поселение Село Омми Амурского муниципального района", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2319", "Хабаровский край", "Городской округ город Комсомольск-на-Амуре", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2399", "Хабаровский край", "Остальная территория края", 0.3);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2400", "Еврейская автономная область", " ", 0.3);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2501", "Амурская область", "Муниципальный район Зейский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2502", "Амурская область", "Муниципальный район Селемджинский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2503", "Амурская область", "Муниципальный район Тындинский (за исключением сельского поселения Муртыгитский сельсовет)", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2504", "Амурская область", "Муниципальный район Зейский, Селемджинский, Тындинский (за исключением сельского поселения Муртыгитский сельсовет)", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2505", "Амурская область", "Муниципальный район Зейский, Селемджинский, Тындинский (за исключением сельского поселения Муртыгитский сельсовет)", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2506", "Амурская область", "Городской округ Зея", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2507", "Амурская область", "Городской округ Тында", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2599", "Амурская область", "Остальная территория области", 0.3);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2601", "Приморский край", "Муниципальный район Кавалеровский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2602", "Приморский край", "Муниципальный район Ольгинский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2603", "Приморский край", "Муниципальный район Тернейский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2604", "Приморский край", "Городское поселение Востокское", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2605", "Приморский край", "Сельское поселение Вострецовское", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2606", "Приморский край", "Сельское поселение Глубинненское", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2607", "Приморский край", "Сельское поселение Дальнекутское", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2608", "Приморский край", "Сельское поселение Измайлихинское", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2609", "Приморский край", "Сельское поселение Мельнично", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2610", "Приморский край", "Сельское поселение Рощинское", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2611", "Приморский край", "Сельское поселение Таежненское сельское поселение Красноармейского муниципального района", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2612", "Приморский край", "Городской округ Дальнегорский", 0.5);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2699", "Приморский край", "Остальная территория края", 0.3);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2701", "Сахалинская область", "Городской округ Курильский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2702", "Сахалинская область", "Городской округ Ногликский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2703", "Сахалинская область", "Городской округ Охинский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2704", "Сахалинская область", "Городской округ Северо-Курильский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2705", "Сахалинская область", "Городской округ Южно-Курильский", 0.8);
	ДобавитьСтрокуВКлассификатор(ТаблицаКлассификатора, "2799", "Сахалинская область", "Остальная территория области", 0.5);
	
	Возврат ТаблицаКлассификатора;
	
КонецФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ОбновитьСправочникИзКлассификатора();
	
КонецПроцедуры

Процедура ОбновитьСправочникИзКлассификатора()
	
	ТаблицаКлассификатора = ТаблицаКлассификатора();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТерриторииСПовышающимКоэффициентомПоКоронавирусу.Код КАК Код,
	|	ТерриторииСПовышающимКоэффициентомПоКоронавирусу.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТерриторииСПовышающимКоэффициентомПоКоронавирусу КАК ТерриторииСПовышающимКоэффициентомПоКоронавирусу
	|ГДЕ
	|	НЕ ТерриторииСПовышающимКоэффициентомПоКоронавирусу.ПометкаУдаления";
	
	ТаблицаСуществующих = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаКлассификатора Из ТаблицаКлассификатора Цикл
		
		НайденныйЭлемент = ТаблицаСуществующих.Найти(СтрокаКлассификатора.Код, "Код");
		
		Если НайденныйЭлемент = Неопределено Тогда
			СправочникОбъект = Справочники.ТерриторииСПовышающимКоэффициентомПоКоронавирусу.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(СправочникОбъект, СтрокаКлассификатора); 
			СправочникОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
		КонецЕсли;
		
	КонецЦикла;
	

КонецПроцедуры

#КонецОбласти

#КонецОбласти
	
#КонецЕсли
